EX0: PROC OPTIONS (MAIN);                                                     DCL A DECIMAL FLOAT INIT ( 0.2 );                                              DCL B DECIMAL FLOAT INIT ( 0.3 );                                             DCL C DECIMAL FLOAT INIT ( 0.4 );                                             DCL D DECIMAL FLOAT;                                                           D = A + B - C;                                                                  END EX0;